betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_dma.h
  __IO DAL_DMA_StateTypeDef  State;                                                            /*!< DMA transfer state                     */

  void                       *Parent;                                                          /*!< Parent object state                    */

  void                       (* XferCpltCallback)( struct __DMA_HandleTypeDef * hdma);         /*!< DMA transfer complete callback         */

  void                       (* XferHalfCpltCallback)( struct __DMA_HandleTypeDef * hdma);     /*!< DMA Half transfer complete callback    */

  void                       (* XferM1CpltCallback)( struct __DMA_HandleTypeDef * hdma);       /*!< DMA transfer complete Memory1 callback */

  void                       (* XferM1HalfCpltCallback)( struct __DMA_HandleTypeDef * hdma);   /*!< DMA transfer Half complete Memory1 callback */

  void                       (* XferErrorCallback)( struct __DMA_HandleTypeDef * hdma);        /*!< DMA transfer error callback            */

  void                       (* XferAbortCallback)( struct __DMA_HandleTypeDef * hdma);        /*!< DMA transfer Abort callback            */

  __IO uint32_t              ErrorCode;                                                        /*!< DMA Error code                         */

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  uint32_t                   StreamBaseAddress;                                                /*!< DMA Stream Base Address                */

  uint32_t                   StreamIndex;                                                      /*!< DMA Stream Index                       */
#else
  DMA_TypeDef                *DmaBaseAddress;                                                  /*!< DMA Channel Base Address               */

  uint32_t                   ChannelIndex;                                                     /*!< DMA Channel Index                      */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
}DMA_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @brief    DMA Exported constants
  * @{
  */

/** @defgroup DMA_Error_Code DMA Error Code
  * @brief    DMA Error Code
  * @{
  */
#define DAL_DMA_ERROR_NONE            0x00000000U    /*!< No error                               */
#define DAL_DMA_ERROR_TE              0x00000001U    /*!< Transfer error                         */
#define DAL_DMA_ERROR_FE              0x00000002U    /*!< FIFO error                             */
#define DAL_DMA_ERROR_DME             0x00000004U    /*!< Direct Mode error                      */
#define DAL_DMA_ERROR_TIMEOUT         0x00000020U    /*!< Timeout error                          */
#define DAL_DMA_ERROR_PARAM           0x00000040U    /*!< Parameter error                        */
#define DAL_DMA_ERROR_NO_XFER         0x00000080U    /*!< Abort requested with no Xfer ongoing   */
#define DAL_DMA_ERROR_NOT_SUPPORTED   0x00000100U    /*!< Not supported mode                     */
/**
  * @}
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup DMA_Channel_selection DMA Channel selection
  * @brief    DMA channel selection
  * @{
  */
#define DMA_CHANNEL_0                 0x00000000U    /*!< DMA Channel 0 */
#define DMA_CHANNEL_1                 0x02000000U    /*!< DMA Channel 1 */
#define DMA_CHANNEL_2                 0x04000000U    /*!< DMA Channel 2 */
#define DMA_CHANNEL_3                 0x06000000U    /*!< DMA Channel 3 */
#define DMA_CHANNEL_4                 0x08000000U    /*!< DMA Channel 4 */
#define DMA_CHANNEL_5                 0x0A000000U    /*!< DMA Channel 5 */
#define DMA_CHANNEL_6                 0x0C000000U    /*!< DMA Channel 6 */
#define DMA_CHANNEL_7                 0x0E000000U    /*!< DMA Channel 7 */
#if defined (DMA_SCFGx_CHSEL_3)
#define DMA_CHANNEL_8                 0x10000000U    /*!< DMA Channel 8 */
#define DMA_CHANNEL_9                 0x12000000U    /*!< DMA Channel 9 */
#define DMA_CHANNEL_10                0x14000000U    /*!< DMA Channel 10 */
#define DMA_CHANNEL_11                0x16000000U    /*!< DMA Channel 11 */
#define DMA_CHANNEL_12                0x18000000U    /*!< DMA Channel 12 */
#define DMA_CHANNEL_13                0x1A000000U    /*!< DMA Channel 13 */
#define DMA_CHANNEL_14                0x1C000000U    /*!< DMA Channel 14 */
#define DMA_CHANNEL_15                0x1E000000U    /*!< DMA Channel 15 */
#endif /* DMA_SCFGx_CHSEL_3 */
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup DMA_Data_transfer_direction DMA Data transfer direction
  * @brief    DMA data transfer direction
  * @{
  */
#define DMA_PERIPH_TO_MEMORY          0x00000000U                     /*!< Peripheral to memory direction */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_MEMORY_TO_PERIPH          ((uint32_t)DMA_CHCFG_DIRCFG)    /*!< Memory to peripheral direction */
#define DMA_MEMORY_TO_MEMORY          ((uint32_t)DMA_CHCFG_M2MMODE)   /*!< Memory to memory direction     */
#else
#define DMA_MEMORY_TO_PERIPH          ((uint32_t)DMA_SCFGx_DIRCFG_0)  /*!< Memory to peripheral direction */
#define DMA_MEMORY_TO_MEMORY          ((uint32_t)DMA_SCFGx_DIRCFG_1)  /*!< Memory to memory direction     */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup DMA_Peripheral_incremented_mode DMA Peripheral incremented mode
  * @brief    DMA peripheral incremented mode
  * @{
  */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_PINC_ENABLE               ((uint32_t)DMA_CHCFG_PERIMODE) /*!< Peripheral increment mode enable  */
#else
#define DMA_PINC_ENABLE               ((uint32_t)DMA_SCFGx_PERIM)    /*!< Peripheral increment mode enable  */
#endif /* APM32F403xx || APM32F402xx */
#define DMA_PINC_DISABLE              0x00000000U                    /*!< Peripheral increment mode disable */
/**
  * @}
  */

/** @defgroup DMA_Memory_incremented_mode DMA Memory incremented mode
  * @brief    DMA memory incremented mode
  * @{
  */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_MINC_ENABLE               ((uint32_t)DMA_CHCFG_MIMODE)  /*!< Memory increment mode enable  */
#else
#define DMA_MINC_ENABLE               ((uint32_t)DMA_SCFGx_MEMIM)   /*!< Memory increment mode enable  */
#endif /* APM32F403xx || APM32F402xx */
#define DMA_MINC_DISABLE              0x00000000U                   /*!< Memory increment mode disable */
/**
  * @}
  */

