betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_dma.h
/** @defgroup DMA_Peripheral_data_size DMA Peripheral data size
  * @brief    DMA peripheral data size
  * @{
  */
#define DMA_PDATAALIGN_BYTE           0x00000000U                        /*!< Peripheral data alignment: Byte     */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_PDATAALIGN_HALFWORD       ((uint32_t)DMA_CHCFG_PERSIZE_0)    /*!< Peripheral data alignment: HalfWord */
#define DMA_PDATAALIGN_WORD           ((uint32_t)DMA_CHCFG_PERSIZE_1)    /*!< Peripheral data alignment: Word     */
#else
#define DMA_PDATAALIGN_HALFWORD       ((uint32_t)DMA_SCFGx_PERSIZECFG_0) /*!< Peripheral data alignment: HalfWord */
#define DMA_PDATAALIGN_WORD           ((uint32_t)DMA_SCFGx_PERSIZECFG_1) /*!< Peripheral data alignment: Word     */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup DMA_Memory_data_size DMA Memory data size
  * @brief    DMA memory data size
  * @{
  */
#define DMA_MDATAALIGN_BYTE           0x00000000U                        /*!< Memory data alignment: Byte     */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_MDATAALIGN_HALFWORD       ((uint32_t)DMA_CHCFG_MEMSIZE_0)    /*!< Memory data alignment: HalfWord */
#define DMA_MDATAALIGN_WORD           ((uint32_t)DMA_CHCFG_MEMSIZE_1)    /*!< Memory data alignment: Word     */
#else
#define DMA_MDATAALIGN_HALFWORD       ((uint32_t)DMA_SCFGx_MEMSIZECFG_0) /*!< Memory data alignment: HalfWord */
#define DMA_MDATAALIGN_WORD           ((uint32_t)DMA_SCFGx_MEMSIZECFG_1) /*!< Memory data alignment: Word     */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup DMA_mode DMA mode
  * @brief    DMA mode
  * @{
  */
#define DMA_NORMAL                    0x00000000U                      /*!< Normal mode                  */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_CIRCULAR                  ((uint32_t)DMA_CHCFG_CIRMODE)    /*!< Circular mode                */
#else
#define DMA_CIRCULAR                  ((uint32_t)DMA_SCFGx_CIRCMEN)    /*!< Circular mode                */
#define DMA_PFCTRL                    ((uint32_t)DMA_SCFGx_PERFC)      /*!< Peripheral flow control mode */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup DMA_Priority_level DMA Priority level
  * @brief    DMA priority levels
  * @{
  */
#define DMA_PRIORITY_LOW              0x00000000U                       /*!< Priority level: Low       */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_PRIORITY_MEDIUM           ((uint32_t)DMA_CHCFG_CHPL_0)      /*!< Priority level: Medium    */
#define DMA_PRIORITY_HIGH             ((uint32_t)DMA_CHCFG_CHPL_1)      /*!< Priority level: High      */
#define DMA_PRIORITY_VERY_HIGH        ((uint32_t)DMA_CHCFG_CHPL)        /*!< Priority level: Very High */
#else
#define DMA_PRIORITY_MEDIUM           ((uint32_t)DMA_SCFGx_PRILCFG_0)   /*!< Priority level: Medium    */
#define DMA_PRIORITY_HIGH             ((uint32_t)DMA_SCFGx_PRILCFG_1)   /*!< Priority level: High      */
#define DMA_PRIORITY_VERY_HIGH        ((uint32_t)DMA_SCFGx_PRILCFG)     /*!< Priority level: Very High */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F465xx) || defined (APM32F411xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
/** @defgroup DMA_FIFO_direct_mode DMA FIFO direct mode
  * @brief    DMA FIFO direct mode
  * @{
  */
#define DMA_FIFOMODE_DISABLE          0x00000000U                  /*!< FIFO mode disable */
#define DMA_FIFOMODE_ENABLE           ((uint32_t)DMA_FCTRLx_DMDEN) /*!< FIFO mode enable  */
/**
  * @}
  */

/** @defgroup DMA_FIFO_threshold_level DMA FIFO threshold level
  * @brief    DMA FIFO level
  * @{
  */
#define DMA_FIFO_THRESHOLD_1QUARTERFULL       0x00000000U                      /*!< FIFO threshold 1 quart full configuration  */
#define DMA_FIFO_THRESHOLD_HALFFULL           ((uint32_t)DMA_FCTRLx_FTHSEL_0)  /*!< FIFO threshold half full configuration     */
#define DMA_FIFO_THRESHOLD_3QUARTERSFULL      ((uint32_t)DMA_FCTRLx_FTHSEL_1)  /*!< FIFO threshold 3 quarts full configuration */
#define DMA_FIFO_THRESHOLD_FULL               ((uint32_t)DMA_FCTRLx_FTHSEL)    /*!< FIFO threshold full configuration          */
/**
  * @}
  */

/** @defgroup DMA_Memory_burst DMA Memory burst
  * @brief    DMA memory burst
  * @{
  */
#define DMA_MBURST_SINGLE             0x00000000U
#define DMA_MBURST_INC4               ((uint32_t)DMA_SCFGx_MBCFG_0)
#define DMA_MBURST_INC8               ((uint32_t)DMA_SCFGx_MBCFG_1)
#define DMA_MBURST_INC16              ((uint32_t)DMA_SCFGx_MBCFG)
/**
  * @}
  */

/** @defgroup DMA_Peripheral_burst DMA Peripheral burst
  * @brief    DMA peripheral burst
  * @{
  */
#define DMA_PBURST_SINGLE             0x00000000U
#define DMA_PBURST_INC4               ((uint32_t)DMA_SCFGx_PBCFG_0)
#define DMA_PBURST_INC8               ((uint32_t)DMA_SCFGx_PBCFG_1)
#define DMA_PBURST_INC16              ((uint32_t)DMA_SCFGx_PBCFG)
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @defgroup DMA_interrupt_enable_definitions DMA interrupt enable definitions
  * @brief    DMA interrupts definition
  * @{
  */
#if defined (APM32F403xx) || defined (APM32F402xx)
#define DMA_IT_TC                     ((uint32_t)DMA_CHCFG_TCINTEN)
#define DMA_IT_HT                     ((uint32_t)DMA_CHCFG_HTINTEN)
#define DMA_IT_TE                     ((uint32_t)DMA_CHCFG_TERRINTEN)
#else
#define DMA_IT_TC                     ((uint32_t)DMA_SCFGx_TXCIEN)
#define DMA_IT_HT                     ((uint32_t)DMA_SCFGx_HTXIEN)
#define DMA_IT_TE                     ((uint32_t)DMA_SCFGx_TXEIEN)
#define DMA_IT_DME                    ((uint32_t)DMA_SCFGx_DMEIEN)
#define DMA_IT_FE                     0x00000080U
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup DMA_flag_definitions DMA flag definitions
  * @brief    DMA flag definitions
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define DMA_FLAG_FEIF0_4              0x00000001U
#define DMA_FLAG_DMEIF0_4             0x00000004U
#define DMA_FLAG_TEIF0_4              0x00000008U
#define DMA_FLAG_HTIF0_4              0x00000010U
#define DMA_FLAG_TCIF0_4              0x00000020U
#define DMA_FLAG_FEIF1_5              0x00000040U
#define DMA_FLAG_DMEIF1_5             0x00000100U
#define DMA_FLAG_TEIF1_5              0x00000200U
#define DMA_FLAG_HTIF1_5              0x00000400U
#define DMA_FLAG_TCIF1_5              0x00000800U
#define DMA_FLAG_FEIF2_6              0x00010000U
#define DMA_FLAG_DMEIF2_6             0x00040000U
#define DMA_FLAG_TEIF2_6              0x00080000U
#define DMA_FLAG_HTIF2_6              0x00100000U
#define DMA_FLAG_TCIF2_6              0x00200000U
#define DMA_FLAG_FEIF3_7              0x00400000U
#define DMA_FLAG_DMEIF3_7             0x01000000U
#define DMA_FLAG_TEIF3_7              0x02000000U
#define DMA_FLAG_HTIF3_7              0x04000000U
#define DMA_FLAG_TCIF3_7              0x08000000U
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
#define DMA_FLAG_GL1                  0x00000001U
#define DMA_FLAG_TC1                  0x00000002U
#define DMA_FLAG_HT1                  0x00000004U
#define DMA_FLAG_TE1                  0x00000008U
#define DMA_FLAG_GL2                  0x00000010U
#define DMA_FLAG_TC2                  0x00000020U
#define DMA_FLAG_HT2                  0x00000040U
#define DMA_FLAG_TE2                  0x00000080U
#define DMA_FLAG_GL3                  0x00000100U
#define DMA_FLAG_TC3                  0x00000200U
#define DMA_FLAG_HT3                  0x00000400U
#define DMA_FLAG_TE3                  0x00000800U
#define DMA_FLAG_GL4                  0x00001000U
#define DMA_FLAG_TC4                  0x00002000U
#define DMA_FLAG_HT4                  0x00004000U
#define DMA_FLAG_TE4                  0x00008000U
#define DMA_FLAG_GL5                  0x00010000U
#define DMA_FLAG_TC5                  0x00020000U
#define DMA_FLAG_HT5                  0x00040000U
#define DMA_FLAG_TE5                  0x00080000U
#define DMA_FLAG_GL6                  0x00100000U
#define DMA_FLAG_TC6                  0x00200000U
#define DMA_FLAG_HT6                  0x00400000U
#define DMA_FLAG_TE6                  0x00800000U
#define DMA_FLAG_GL7                  0x01000000U
#define DMA_FLAG_TC7                  0x02000000U
#define DMA_FLAG_HT7                  0x04000000U
#define DMA_FLAG_TE7                  0x08000000U
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

